testCases/OF_Nu12_Fi25b_dT20_U0_5_D16_CUT/constant/fluid/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//For condensation values of condensate are used.
//For evaporation values of vapor are used.

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (kondensate vapor);
sigma          sigma [1 0 -2 0 0 0 0] 0.014698;
thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        nMoles          1;
        molWeight       187.375;
    }
    equationOfState
    {
        rho             1508.2;
    }
    thermodynamics
    {
        Cp              940.37;
        Hf              0;
    }
    transport
    {
        mu              501.89e-6;
        Pr              6.99307;
    }
}

// ************************************************************************* //
