testCases/OF_Nu12_Fi25b_dT20_U0_5_D16_CUT/0/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0/fluid";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform ( 0 -0.5 0 );
    }
    outlet
    {
	type            inletOutlet;
	inletValue      uniform ( 0 -0.5 0 );
	value           uniform ( 0 0 0 );
    }

    left
    {
        type            zeroGradient;
    }
    right
    {
        type            zeroGradient;
    }
    cyl_1
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
