testCases/OF_Nu12_Fi25b_dT20_U0_5_D16_CUT/0/fluid/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0/fluid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 320.735;

boundaryField
{
    inlet
    {
        type            inletOutlet;
        value           uniform 320.735;
        inletValue      uniform 320.735;
    }
    outlet
    {
        type            zeroGradient;
    }

    left
    {
        type            zeroGradient;
    }
    right
    {
        type            zeroGradient;
    }
    cyl_1
    {
        type            fixedValue;
        value           uniform 300.735;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
