testCases/OF_Nu12_Fi25b_dT20_U0_5_D16_CUT/0/fluid/alpha.kondensate.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0/fluid";
    object      alpha.kondensate;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    outlet
    {
        type            inletOutlet;
        inletValue     uniform 0;
        value           uniform 0;
    }

    left
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    right
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    cyl_1
    {
        type            constantAlphaContactAngle;
        value           uniform 1;
        inletValue      uniform 0;
        theta0          0;
        limit           gradient;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
